/// @file       lader.h
/// @brief      Файл с объявлениями модуля парсинга данных логического анализатора
/// @details    Порядок работы с модулем: <br>
///                 1) TODO <br>
/// @author     Тузиков Г.А. janisrus35@gmail.com

//
// Объявления внешних функций
//

/// @brief      Функция парсинга данных логического анализатора
/// @details    Данная функция выполняет TODO
/// @param[in]  inputFilePtr  Указатель на входной  файл
/// @param[in]  outputFilePtr Указатель на выходной файл
/// @return     Возвращает 0 в случае успешного парсинга данных логического анализатора
///                 В противном случае, возвращает код ошибки
int lader(const char *inputFilePtr, const char *outputFilePtr);
